let Now = now();
(range TimeGenerated from ago(7d) to Now - 1d step 1d
| extend Count = 0
| union isfuzzy=true
    (SecurityIncident 
    | where ProviderName == "Microsoft 365 Defender" or ProviderName == "Microsoft XDR"
    | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
| summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
| sort by TimeGenerated
| project Value = iff(isnull(Count), 0, Count), Time = TimeGenerated, Legend = "Incidents")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (SecurityAlert 
        | where ProductName in("Microsoft Defender Advanced Threat Protection", "Office 365 Advanced Threat Protection", "Azure Advanced Threat Protection", "Microsoft Cloud App Security", "Microsoft 365 Defender", "Azure Active Directory Identity Protection")
        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), "OriginalProductName")
        | where alertWasCustomized == false
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project Value = iff(isnull(Count), 0, Count), Time = TimeGenerated, Legend = "Alerts")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (DeviceEvents
        | union isfuzzy=true DeviceFileEvents
        | union isfuzzy=true DeviceImageLoadEvents
        | union isfuzzy=true DeviceInfo
        | union isfuzzy=true DeviceLogonEvents
        | union isfuzzy=true DeviceNetworkEvents
        | union isfuzzy=true DeviceNetworkInfo
        | union isfuzzy=true DeviceProcessEvents
        | union isfuzzy=true DeviceRegistryEvents
        | union isfuzzy=true DeviceFileCertificateInfo
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project
        Value = iff(isnull(Count), 0, Count),
        Time = TimeGenerated,
        Legend = "Endpoint Events")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (EmailEvents
        | union isfuzzy=true EmailUrlInfo
        | union isfuzzy=true EmailAttachmentInfo
        | union isfuzzy=true EmailPostDeliveryEvents
        | union isfuzzy=true UrlClickEvents
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project
        Value = iff(isnull(Count), 0, Count),
        Time = TimeGenerated,
        Legend = "Office Events")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (IdentityLogonEvents
        | union isfuzzy=true IdentityQueryEvents
        | union isfuzzy=true IdentityDirectoryEvents
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project
        Value = iff(isnull(Count), 0, Count),
        Time = TimeGenerated,
        Legend = "Identity Events")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (CloudAppEvents
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project
        Value = iff(isnull(Count), 0, Count),
        Time = TimeGenerated,
        Legend = "Cloud app Events")
| union isfuzzy = true(range TimeGenerated from ago(7d) to Now - 1d step 1d
    | extend Count = 0
    | union isfuzzy=true
        (AlertInfo
        | union isfuzzy=true AlertEvidence
        | summarize Count = count() by bin_at(TimeGenerated, 1d, Now))
    | summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
    | sort by TimeGenerated
    | project
        Value = iff(isnull(Count), 0, Count),
        Time = TimeGenerated,
        Legend = "Defender Alerts")
| render timechart